-- Амиров 
CREATE DATABASE Автопрокат;
GO
USE Автопрокат;
GO
CREATE TABLE Клиент (
	Код INT IDENTITY(1,1) NOT NULL,
	ФИО NVARCHAR(MAX),
	СерияПаспорта NUMERIC(4,0),
	НомерПаспорта NUMERIC(6,0),

	PRIMARY KEY(Код)
);

CREATE TABLE Автомобиль (
	Код INT IDENTITY(1,1) NOT NULL,
	Модель NVARCHAR(MAX),
	Цвет NVARCHAR(40),
	ГодВыпуска NUMERIC(4,0),
	Госномер NVARCHAR(10),
	СтраховаяСтоимость NUMERIC(9,0),
	СтоимостьОдногоДня NUMERIC(6,0),

	PRIMARY KEY(Код)
);

CREATE TABLE АвтомобильКлиент (
	Код INT IDENTITY(1,1) NOT NULL,
	КодКлиента INT NOT NULL,
	КодАвтомобиля INT NOT NULL,
	ДатаНачалаПроката DATE,
	КолчествоДнейПроката NUMERIC(2,0),

	PRIMARY KEY(Код),
	CONSTRAINT FK_АвтомобильКлиент_Клиент FOREIGN KEY (КодКлиента)
	REFERENCES Клиент (Код),
	CONSTRAINT FK_АвтомобильКлиент_Автомобиль FOREIGN KEY (КодАвтомобиля)
	REFERENCES Автомобиль (Код)
	ON DELETE CASCADE ON UPDATE CASCADE
);

CREATE TABLE Прокат (
	Код INT IDENTITY(1,1) NOT NULL,
	Название NVARCHAR(MAX),
	ЮридическийАдрес NVARCHAR(255),

	PRIMARY KEY(Код)
);

CREATE TABLE АвтомобильКлиентПрокат (
	Код INT IDENTITY(1,1) NOT NULL,
	КодАвтомобильКлиента INT NOT NULL,
	КодПроката INT NOT NULL,

	PRIMARY KEY(Код),
	CONSTRAINT FK_АвтомобильКлиентПрокат_Прокат FOREIGN KEY (КодПроката)
	REFERENCES Прокат (Код),
	CONSTRAINT FK_АвтомобильКлиентПрокат_АвтомобильКлиент FOREIGN KEY (КодАвтомобильКлиента)
	REFERENCES АвтомобильКлиент (Код)
	ON DELETE CASCADE ON UPDATE CASCADE
);
GO
INSERT INTO Автомобиль
	VALUES	('VW Golf', 'Белый', 2012, 'Е224МР69', 400000, 10500),
			('Toyota Yaris', 'Красный', 2012, 'А820СХ69', 700000, 10500),
			('Mercedes Benz GLC Class', 'Синий', 2006, 'В340КО69', 600000, 20500),
			('Buick Encore', 'Серый', 2008, 'Т720МР69', 700000, 4500),
			('Nissan Rogue', 'Оранжевый', 2013, 'Р016УР69', 400000, 8500),
			('Alfa Romeo Giulia', 'Красный', 2014, 'С761РТ69', 400000, 16500),
			('Land Rover Discovery', 'Серый', 2015, 'A777KTR69', 200000, 4500),
			('Kia Ceed', 'Синий', 2011, 'В340КО69', 600000, 12500),
			('Volvo V40', 'Серый', 2010, 'Н350ХК69', 200000, 8500),
			('Ford Focus', 'Белый', 2007, 'А648МВ69', 500000, 6500);
SELECT * FROM Автомобиль;
GO
INSERT INTO Клиент
	VALUES	('Шестаков Феликс Юрьевич', 2135, 449835),
			('Степанов Аввакуум Константинович', 2764, 168723),
			('Родионов Карл Филатович', 3628, 566373),
			('Игнатов Александр Кимович', 2455, 503417),
			('Панов Варлаам Евсеевич', 3844, 307527),
			('Веселов Сергей Донатович', 3015, 898452),
			('Карпов Август Никитевич', 3624, 582544),
			('Лаврентьев Мечеслав Яковлевич', 3496, 815274),
			('Белозёров Ростислав Борисович', 2242, 258435),
			('Родионов Орест Адольфович', 3904, 753323);
SELECT * FROM Клиент;
GO
INSERT INTO АвтомобильКлиент
	VALUES	(1, 1, '2020-01-14', 14),
			(2, 2, '2020-05-28', 7),
			(3, 3, '2020-04-20', 60),
			(4, 2, '2020-06-21', 30),
			(5, 1, '2020-02-17', 30),
			(6, 4, '2020-04-21', 14),
			(2, 4, '2020-06-12', 14),
			(7, 5, '2020-04-13', 30),
			(8, 4, '2020-05-06', 30),
			(2, 6, '2020-04-16', 30),
			(3, 7, '2020-06-21', 7),
			(5, 8, '2020-01-22', 14),
			(9, 7, '2020-04-15', 60),
			(3, 8, '2020-07-05', 14),
			(4, 9, '2020-04-20', 60),
			(7, 7, '2020-05-17', 7),
			(1, 4, '2020-01-29', 14),
			(10, 2, '2020-04-14', 14),
			(8, 10, '2020-04-17', 14);
SELECT * FROM АвтомобильКлиент;
GO
INSERT INTO Прокат
	VALUES	('ЧелнокМонстр', '904375, Рязанская область, город Зарайск, ул. Сталина, 35'),
			('ЛабКорма', '571918, Самарская область, город Коломна, спуск Гагарина, 61'),
			('ЛабРадар', '364103, Свердловская область, город Воскресенск, проезд Гагарина, 75'),
			('Силбиг', '668122, Курская область, город Талдом, пр. Космонавтов, 29'),
			('Векторперевозка', '991191, Пензенская область, город Лотошино, наб. Домодедовская, 82'),
			('ПарусКонсалт', '989257, Курганская область, город Дмитров, въезд Славы, 62'),
			('ПеревозкаАльянс', '233714, Псковская область, город Щёлково, бульвар Будапештсткая, 68'),
			('МегаПеревозка', '755529, Амурская область, город Чехов, бульвар Гагарина, 80'),
			('Кимслед', '581930, Омская область, город Луховицы, въезд Чехова, 35'),
			('ХотШлюз', '179308, Тюменская область, город Щёлково, пл. Ломоносова, 01');
SELECT * FROM Прокат;
GO
INSERT INTO АвтомобильКлиентПрокат
	VALUES	(1, 1),
			(2, 2),
			(3, 3),
			(4, 4),
			(5, 5),
			(6, 6),
			(7, 7),
			(8, 8),
			(9, 2),
			(10, 2),
			(11, 3),
			(12, 5),
			(13, 4),
			(14, 3),
			(15, 4),
			(16, 8),
			(17, 1),
			(18, 9),
			(19, 2);
SELECT * FROM АвтомобильКлиентПрокат;